#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
/************************************************************数据在内存中的存储***************************************************************************/
/************************************************************数据在内存中的存储***************************************************************************/
/************************************************************数据在内存中的存储***************************************************************************/
//int main()
//{
////练习一：输出什么
//	char a = -1;						//这里的整型-1被字符变量a接收要发生截断，截断以后的二进制数为：11111111
//	signed char b = -1;					//这里的整型-1被字符变量a接收要发生截断，截断以后的二进制数为：11111111
//	unsigned char c = -1;				//这里的整型-1被无符号的字符变量a接收要发生截断，截断以后的二进制数为：11111111
//	printf("a=%d,b=%d,c=%d",a,b,c);		//字符变量a被要求以整型打印，这里要发生整型提升，提升规则：按照变量的数据类型的符号位来提升。提升以后二进制为
//										//11111111111111111111111111111111,输出的源码为：10000000000000000000000000000001，对应的十进制数为-1。
//	return 0;							//b和a一样的转变方法
//										//字符变量c被要求以整型打印，这里要发生整型提升，因为这里的c为无符号位，所以默认是在低8位的前面补0
//										//补好以后的二进制为：00000000000000000000000011111111，输出的源码为：00000000000000000000000011111111，对应的十进制数是255
//}

//int main()
//{
////练习二：输出什么
//	char a = -128;						//这里的整型-128被字符变量a接收要发生截断，截断以后的二进制数为：10000000
//	printf("%u\n",a);					//字符变量a被要求以无符号整型打印，这里要整型提升。11111111111111111111111110000000
//	return 0;							//因为提升以后为无符号数，所以它的源码、反码、补码都一样，则输出的十进制数为:4294967168
//																		
//}

//int main()
//{
////练习三：输出什么
//	char a = 128;
//	printf("%u\n",a);
//	return 0;
////结果：4294967168
//}

int main()
{
//练习四：输出什么
	int i = -20;				//-20的源码：100000000000000000000000000010100
	unsigned int j = 10;		//-20的补码：111111111111111111111111111101010
	printf("%d\n",i+j);			//10的 补码：100000000000000000000000000001010
	return 0;				  //i + j的补码：011111111111111111111111111110100
							  //i + j的原码：100000000000000000000000000001010
}

//int main()
//{
////练习5：输出什么
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n",i);						//这里的i循环到i=-1时，因为i为无符号整型，所以i在计算机的补码是一个很大的数
//		Sleep(1000);
//	}
//	return 0;
////结果：9 8 7 6 5 4 3 2 1 0 4294967295 4294967294
//}

//int main()
//{
////练习6：输出什么
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;				
//	}								
//	printf("%d",strlen(a));
//	return 0;
////结果：255
////i=0时，整型-1转换成字符型要发生截断，截断以后的二进制补码为11111111，该二进制源码对应的十进制数是-1
////i=1时，整型-2转换成字符型要发生截断，截断以后的二进制补码为11111110，该二进制源码对应的十进制数是-2
////...
////i=127时，整型-128转换成字符型要发生截断，截断以后的二进制补码为10000000，该二进制源码对应的十进制数是-128
////i=128时，整型-129转换成字符型要发生截断，截断以后的二进制补码为01111111，该二进制源码对应的十进制数是127
////i=129时，整型-130转换成字符型要发生截断，截断以后的二进制补码为01111110，该二进制源码对应的十进制数是126
////i=255时，整型-256转换成字符型要发生截断，截断以后的二进制补码为00000001，该二进制源码对应的十进制数是1
////i=256时，整型-257转换成字符型要发生截断，截断以后的二进制补码为00000000，该二进制源码对应的十进制数是0
////strlen()函数统计的是'\0'之前的字符长度，'\0'的ASCII码为0，所以0之前一共有255个字符，长度就为255
//}

unsigned char i = 0;
int main()
{
//练习7:输出什么
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");		//这里的i是无符号数，它的取值范围为0-255，<=255恒成立，所以是个死循环
	}
	return 0;
}


#include <stdio.h>
#include <windows.h>
//int main()
//{
////练习5：输出什么
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n",i);						//这里的i循环到i=-1时，因为i为无符号整型，所以i在计算机的补码是一个很大的数
//		Sleep(1000);
//	}
//	return 0;
////结果：9 8 7 6 5 4 3 2 1 0 4294967295 4294967294
//}

//int main()
//{
////练习6：输出什么
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;				
//	}								
//	printf("%d",strlen(a));
//	return 0;
////结果：255
////i=0时，整型-1转换成字符型要发生截断，截断以后的二进制补码为11111111，该二进制源码对应的十进制数是-1
////i=1时，整型-2转换成字符型要发生截断，截断以后的二进制补码为11111110，该二进制源码对应的十进制数是-2
////...
////i=127时，整型-128转换成字符型要发生截断，截断以后的二进制补码为10000000，该二进制源码对应的十进制数是-128
////i=128时，整型-129转换成字符型要发生截断，截断以后的二进制补码为01111111，该二进制源码对应的十进制数是127
////i=129时，整型-130转换成字符型要发生截断，截断以后的二进制补码为01111110，该二进制源码对应的十进制数是126
////i=255时，整型-256转换成字符型要发生截断，截断以后的二进制补码为00000001，该二进制源码对应的十进制数是1
////i=256时，整型-257转换成字符型要发生截断，截断以后的二进制补码为00000000，该二进制源码对应的十进制数是0
////strlen()函数统计的是'\0'之前的字符长度，'\0'的ASCII码为0，所以0之前一共有255个字符，长度就为255
//}

//unsigned char i = 0;
//int main()
//{
////练习7:输出什么
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");		//这里的i是无符号数，它的取值范围为0-255，<=255恒成立，所以是个死循环
//	}
//	return 0;
//}


//int main()
//{
////浮点数存储的例子
//	int n = 9;
//	float* pfloat = (float* )&n;		//这里的整型n被强制转换为float型
//	printf("n的值为:%d\n",n);
//	printf("pfloat的值为:%f\n",*pfloat);	//这里要求以浮点型打印——先将整型9的二进制表示出来：00000000 00000000 00000000 00001001。这个二进制的第一位是符号位，第一个0之后的8个0为指数位，再后面的23位为有效位。
//											//则按照IEEE754规定可以表示为：-1^0*0.00000000000000000001001*2^00000000=0.000000,浮点数打印出来就是这个数
//	*pfloat = 9.0;						//这里将整数n存放的内容改成浮点数9.0
//	printf("num的值为:%d\n",n);			//这里要求以整型打印——先将浮点型9.0的二进制表示出来：1001.0，即1.001*2^3，按照IEEE754规定可以表示为-1^0*1.001*2^3,S等于0，M等于1.001，E等于3+127=130。
//										//指数E用二进制表示为：10000010，则写成标准的二进制形式为：0 10000010 00000000000000000000001=01000001000000000000000000000001，将这个数以十进制打印出来就是1091567616
//	printf("*pfloat的值为:%f\n", *pfloat);	
//	return 0;
////结果：
////n的值为:9
////pfloat的值为 : 0.000000
////num的值为 : 1091567616
////* pfloat的值为 : 9.000000
//}

