#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
/************************************************************数据在内存中的存储***************************************************************************/
/************************************************************数据在内存中的存储***************************************************************************/
/************************************************************数据在内存中的存储***************************************************************************/
//int main()
//{
////练习一：输出什么
//	char a = -1;						//这里的整型-1被字符变量a接收要发生截断，截断以后的二进制数为：11111111
//	signed char b = -1;					//这里的整型-1被字符变量a接收要发生截断，截断以后的二进制数为：11111111
//	unsigned char c = -1;				//这里的整型-1被无符号的字符变量a接收要发生截断，截断以后的二进制数为：11111111
//	printf("a=%d,b=%d,c=%d",a,b,c);		//字符变量a被要求以整型打印，这里要发生整型提升，提升规则：按照变量的数据类型的符号位来提升。提升以后二进制为
//										//11111111111111111111111111111111,输出的源码为：10000000000000000000000000000001，对应的十进制数为-1。
//	return 0;							//b和a一样的转变方法
//										//字符变量c被要求以整型打印，这里要发生整型提升，因为这里的c为无符号位，所以默认是在低8位的前面补0
//										//补好以后的二进制为：00000000000000000000000011111111，输出的源码为：00000000000000000000000011111111，对应的十进制数是255
//}

//int main()
//{
////练习二：输出什么
//	char a = -128;						//这里的整型-128被字符变量a接收要发生截断，截断以后的二进制数为：10000000
//	printf("%u\n",a);					//字符变量a被要求以无符号整型打印，这里要整型提升。11111111111111111111111110000000
//	return 0;							//因为提升以后为无符号数，所以它的源码、反码、补码都一样，则输出的十进制数为:4294967168
//																		
//}

//int main()
//{
////练习三：输出什么
//	char a = 128;
//	printf("%u\n",a);
//	return 0;
////结果：4294967168
//}

int main()
{
//练习四：输出什么
	int i = -20;				//-20的源码：100000000000000000000000000010100
	unsigned int j = 10;		//-20的补码：111111111111111111111111111101010
	printf("%d\n",i+j);			//10的 补码：100000000000000000000000000001010
	return 0;				  //i + j的补码：011111111111111111111111111110100
							  //i + j的原码：100000000000000000000000000001010
}