#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//int main()
//{
////练习：喝汽水，意愿一瓶汽水，两个空瓶可以换一瓶汽水，问20元可以喝多少瓶汽水
//	int money = 0;
//	scanf("%d",&money);
//	int total = 0;		//总共喝的汽水数量
//	int empty = 0;		//记录空瓶数量
//	empty += money;
//	total += money;
//	while (empty >= 2)
//	{
//		total += empty / 2;
//		empty = empty / 2 + empty % 2;
//	}
//	printf("%d\n",total);
//	return 0;
//}

//int main()
//{
////输出打印杨辉三角
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			if (0 == j)
//				arr[i][0] = 1;
//			if (i == j)
//				arr[i][j] = 1;
//			if (i >= 2)
//				arr[i][j] = arr[i-1][j] + arr[i-1][j-1];
//			printf("%d  ",arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
////结果：
////	1
////	1  1
////	1  2  1
////	1  3  3  1
////	1  4  6  4  1
////	1  5  10  10  5  1
////	1  6  15  20  15  6  1
////	1  7  21  35  35  21  7  1
////	1  8  28  56  70  56  28  8  1
////	1  9  36  84  126  126  84  36  9  1
//}

//int main()
//{
////才凶手：
////题目内容：
////日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个
////A说：不是我
////B说：是C
////C说：是D
////D说：C在胡说
////已知3个人说了真话，一个人说的是假话。
////现在根据这些信息，写一个程序来确定到底谁是凶手
//	int killer = 0;
//	for (killer = 'A'; killer <= 'D'; killer++)
//	{
//		if ((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D') == 3)
//			printf("killer=%c\n", killer);
//	}
//	return 0;
//}

//int main()
//{
////5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
////A选手说：B第二，我第三；
////B选手说：我第二，E第四；
////C选手说：我第一，D第二；
////D选手说：C最后，我第三；
////E选手说：我第四，A第一；
////比赛结束后，每位选手都说对了一半，请编程确定比赛的名词
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if((b == 2)+(a==3)==1
//							&&(b==2)+(e==4)==1
//							&&(c==1)+(d==2)==1
//							&&(c==5)+(d==3)==1
//							&&(e==4)+(a==1)==1&&(a*b*c*d*e==120))
//							printf("a = %d b = %d c = %d d = %d e = %d\n",a,b,c,d,e);
//					}
//				}
//			}
//		}
//	}
//	return 0;
////结果：
////a = 3 b = 1 c = 5 d = 2 e = 4
//}

